In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )','12. Air France', '"Swiss Air"']})

In [3]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [4]:
df['FlightNumber'][1]=10055

<ipython-input-4-adc3a1f5bfeb>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['FlightNumber'][1]=10055

In [5]:
df['FlightNumber'].iloc[3]=10075

C:\Users\LENOVO\anaconda3\lib\site-packages\pandas\core\indexing.py:670: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  iloc._setitem_with_indexer(indexer, value)

In [6]:
 df.dropna(inplace=True)

In [7]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [8]:
df[['city1','city2']]=df.From_To.str.split("_",expand=True)

In [9]:
df

,From_To,FlightNumber,RecentDelays,Airline,city1,city2
0,LoNDon_paris,10045.0,"[23, 47]",KLM(!),LoNDon,paris
1,MAdrid_miLAN,10055.0,[],<Air France> (12),MAdrid,miLAN
2,londON_StockhOlm,10065.0,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
3,Budapest_PaRis,10075.0,[13],12. Air France,Budapest,PaRis
4,Brussels_londOn,10085.0,"[67, 32]","""Swiss Air""",Brussels,londOn

In [10]:
def test(x):
    for i in x:
         c=x.capitalize()
         return c

In [11]:
test("x")

'X'

In [12]:
df['city2']=df['city2'].apply(test)

In [13]:
df

,From_To,FlightNumber,RecentDelays,Airline,city1,city2
0,LoNDon_paris,10045.0,"[23, 47]",KLM(!),LoNDon,Paris
1,MAdrid_miLAN,10055.0,[],<Air France> (12),MAdrid,Milan
2,londON_StockhOlm,10065.0,"[24, 43, 87]",(British Airways. ),londON,Stockholm
3,Budapest_PaRis,10075.0,[13],12. Air France,Budapest,Paris
4,Brussels_londOn,10085.0,"[67, 32]","""Swiss Air""",Brussels,London

In [14]:
df.drop('From_To',axis=1,inplace=True)

In [15]:
df

   FlightNumber  RecentDelays              Airline     city1      city2
0       10045.0      [23, 47]               KLM(!)    LoNDon      Paris
1       10055.0            []    <Air France> (12)    MAdrid      Milan
2       10065.0  [24, 43, 87]  (British Airways. )    londON  Stockholm
3       10075.0          [13]       12. Air France  Budapest      Paris
4       10085.0      [67, 32]          "Swiss Air"  Brussels     London

In [16]:
df3 = pd.DataFrame(df['RecentDelays'].values.tolist())
df3

      0     1     2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN

In [17]:
length_cols = df3.shape[1]
length_cols

3

In [18]:
df3.columns[0]

0

In [19]:
col_list = []
col_dict ={}
for i in range(length_cols):
 Key = df3.columns[i]
 #print(key,i)
 Value = "Delay" + str(i+1)
 col_dict[Key] = Value
col_dict

{0: 'Delay1', 1: 'Delay2', 2: 'Delay3'}

In [20]:
df3.rename(columns=col_dict,inplace=True)
df3

   Delay1  Delay2  Delay3
0    23.0    47.0     NaN
1     NaN     NaN     NaN
2    24.0    43.0    87.0
3    13.0     NaN     NaN
4    67.0    32.0     NaN

In [21]:
df[["Delay1","Delay2","Delay3"]] = df3[["Delay1","Delay2","Delay3"]]

In [22]:
df

,FlightNumber,RecentDelays,Airline,city1,city2,Delay1,Delay2,Delay3
0,10045.0,"[23, 47]",KLM(!),LoNDon,Paris,23.0,47.0,NaN
1,10055.0,[],<Air France> (12),MAdrid,Milan,NaN,NaN,NaN
2,10065.0,"[24, 43, 87]",(British Airways. ),londON,Stockholm,24.0,43.0,87.0
3,10075.0,[13],12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085.0,"[67, 32]","""Swiss Air""",Brussels,London,67.0,32.0,NaN

In [23]:
df.drop('RecentDelays',axis=1,inplace=True)
df

,FlightNumber,Airline,city1,city2,Delay1,Delay2,Delay3
0,10045.0,KLM(!),LoNDon,Paris,23.0,47.0,NaN
1,10055.0,<Air France> (12),MAdrid,Milan,NaN,NaN,NaN
2,10065.0,(British Airways. ),londON,Stockholm,24.0,43.0,87.0
3,10075.0,12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085.0,"""Swiss Air""",Brussels,London,67.0,32.0,NaN